# Port Security
Port security digunakan untuk membatasi akses pada suatu port pada switch. Misalkan suatu port hanya bisa diakses untuk komputer tertentu atau device tertentu. Sehingga, jika ada device yang tidak diingikan mencoba terhubung melalui port tersebut maka akan ditolak.

## Konfigurasi – Static
Sebagai contoh, port fa0/1 pada switch hanya boleh diakses oleh PC dengan MAC Address 00:11:22:33:44:55. Jika ada device lain yang terhubung melalui port tersebut, maka port tersebut akan shudown dengan otomatis.
<pre>
S1(config)# int fa0/1
S1(config-if)# switchport mode access
S1(config-if)# switchport port-security
S1(config-if)# switchport port-security mac-addess 00:11:22:33:44:55
S1(config-if)# switchport port security violation shutdown
</pre>

Setelah itu lakukan ping dari PC dengan MAC Address 00:11:22:33:44:55. Kemudian cabut port dan hubungkan PC lain ke port tersebut. Lakukan tes ping. Maka otomatis port tersebut akan mati.<br>

Untuk melihat status port-security:
<pre>
S1# show port-security
S1# show port-security interface fa0/1
S1# show port-security address
</pre>

## Konfigurasi – Dinamis
Pada port security dinamis tidak perlu menentukan MAC Address satu persatu. Misalkan port fa0/2 dapat digunakan maksimal 2 PC. Maka untuk 2 PC pertama yang terhubung ke port fa0/2 yang mendapatkan akses. Selebihnya jika ada PC lain yang terhubung, maka akan diblokir sesuai dengan violation yang berlaku.
<pre>
S1(config)# int fa0/2
S1(config-if)# switchport mode access
S1(config-if)# switchport port-security
S1(config-if)# switchport port-security mac-address sticky
S1(config-if)# switchport port-security maximum 2
S1(config-if)# switchport port security violation shutdown
</pre>

PC ketiga secara otomatis akan diblok oleh switch, karena maksimum yang diizinkan hanya 2 PC pertama.<br>

Untuk menghapus MAC address pada port security :
<pre>
S1# clear port-security all
S1# clear port-security configured
S1# clear port-security dynamic
S1# clear port-security sticky
</pre>
