# VLAN TRUNKs
Trunk pada VLAN adalah penghubung banyak VLAN yang berada di antara switch atau switch dengan router. Trunk berfungsi sebagai pengangkut banyak VLAN melewati sebuah jalur. Sehingga satu jalur atau port dapat membawa banyak VLAN.

<img src="https://drive.google.com/uc?export=view&id=1gci1_xoI7beSmrd_vZdAMYRTE56MX6f7">

### A. Trunk pada VLAN
Bisa dilihat pada gambar di atas, port trunk akan menghubungkan host yang berada pada VLAN 1 dan VLAN 2 di Switch Kiri menuju Switch Kanan atau sebaliknya.

## Konfigurasi
<img src="https://drive.google.com/uc?export=view&id=1y8ewz7Kiqk3q-u9b4GWbFpWxFw0W-cdw">

<pre>
//mendefinisikan VLAN
S1(config)# vlan 10
S1(config-vlan)# name sales
S1(config)# vlan 20
S1(config-vlan)# name marketing
S1(config)# vlan 99
S1(config-vlan)# name management

//menentukan port access untuk VLAN 10
S1(config)# int range fa0/1-10
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan 10

//menentukan port access untuk VLAN 20
S1(config)# int range fa0/11-20
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan 20

//konfigurasi port trunk
S1(config)# int g0/1
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk allowed vlan 10

//untuk mengubah native vlan
S1(config-if)# switchport trunk native vlan 99

</pre>

<pre>
//mendefinisikan VLAN
S2(config)# vlan 10
S2(config-vlan)# name sales
S2(config)# vlan 20
S2(config-vlan)# name marketing
S2(config)# vlan 99
S2(config-vlan)# name management

//menentukan port access untuk VLAN 10
S2(config)# int range fa0/1-10
S2(config-if)# switchport mode access
S2(config-if)# switchport access vlan 10

//menentukan port access untuk VLAN 20
S2(config)# int range fa0/11-20
S2(config-if)# switchport mode access
S2(config-if)# switchport access vlan 20

//konfigurasi port trunk
S2(config)# int g0/1
S2(config-if)# switchport mode trunk
S2(config-if)# switchport trunk allowed vlan 10

//untuk mengubah native vlan
S2(config-if)# switchport trunk native vlan 99

</pre>

Lakukan tes ping pada masing-masing VLAN. Dari konfigurasi di atas seharusnya yang bisa berkomunikasi hanya host yang berada pada VLAN 10.<br>

Jika ingin menambahkan akses kepada VLAN mana yang bisa melewati port trunk, maka bisa menambahkan dengan perintah:
<pre>
S1(config-if)# switchport trunk allowed vlan add 20
S2(config-if)# switchport trunk allowed vlan add 20
</pre>

Jika ingin memperbolehkan semua VLAN melewati port trunk tersebut:
<pre>
S1(config-if)# switchport trunk allowed vlan all
S2(config-if)# switchport trunk allowed vlan all
</pre>

Untuk melihat konfigurasi port trunk:
<pre>
S1# show interfaces trunk
</pre>

## Dynamic Trunking Protokol
Jika sebelumnya konfigurasi trunk dilakukan secara manual, maka dapat dilakukan secara otomatis menggunakan DTP. Mode yang digunakan pada DTP adalah dynamic.

<pre>
//Pada Switch 1
S1(config)# int g0/1 
S1(config-if)# switchport mode dynamic desirable

//Pada Switch 2
S2(config)# int g0/1 
S2(config-if)# switchport mode dynamic desirable
</pre>

Jika dikonfigurasi pada mode dynamic desirable maka seakan-akan port tersebut akan langsung terkonfigurasi sebagai trunk. Jika salah satu switch dikonfigurasi dengan mode dynamic auto, maka otomatis akan mengikuti yang dynamic desirable. Sebagai contoh:

<pre>
//Pada Switch 1
S1(config)# int g0/1 
S1(config-if)# switchport mode dynamic desirable

//Pada Switch 2
S2(config)# int g0/1 
S2(config-if)# switchport mode dynamic auto
</pre>

Untuk melihat status pada port trunk tersebut:

<pre>
S1# show interfaces g0/1 switchport
----------------------------------------------------------------------
Administrative Mode: dynamic desirable
Operational Mode: trunk
----------------------------------------------------------------------

</pre>

<pre>
S2# show interfaces g0/1 switchport
----------------------------------------------------------------------
Administrative Mode: dynamic auto
Operational Mode: trunk
----------------------------------------------------------------------
</pre>

Untuk mengaktifkan trunk pada Switch yang tidak mendukung DTP:

<pre>
$ switchport mode trunk
$ switchport nonegotiate</pre>

## Perintah Pendukung

<pre>

</pre>
