# Static Routing

<img align="center" src="https://drive.google.com/uc?export=view&id=1vms8RtzOU9uErq34RE_5bbSuxn5RfUnQ">

Static Routing digunakan untuk mengatur rute paket secara manual. Jadi rute paket ke arah network tertentu dapat ditentukan sendiri. Static Routing dapat digunakan untuk jaringan dengan skala kecil. Jika jaringan sudah masuk ke kategori menengah ke atas, maka cara ini terlalu rumit untuk digunakan. Sehingga sangat butuh ketelitian untuk melakukannya.

Untuk melihat tabel routing:

<pre>
  R1> show ip route
</pre>

<img align="center" src="https://drive.google.com/uc?export=view&id=1vBhPIGdX2ZreWNtBeQF-kzfJ6fvUdBc1">

Topologi Sederhana Static Routing

Pada contoh di atas, jika R1 ingin mengirimkan paket ke R4 melalui R2, maka konfigurasi routing-nya adalah sebagai berikut:

<pre>
R1> ip route 20.20.20.0 255.255.255.0 10.10.10.254
R4> ip route 10.10.10.0 255.255.255.0 20.20.20.1 
</pre>

Pada R1, paket yang akan dikirimkan ke R4 akan melalui hop R2 dengan IP 10.10.10.254. Dan sebaliknya, paket dari R4 akan dirimkan ke R1 melalui R2 dengan IP 20.20.20.1. Lakukan tes ping untuk memastiakan bahwa R1 dan R4 sudah dapat berkomunikasi.

<img align="center" src="https://drive.google.com/uc?export=view&id=1pn2kanBNXO2zavwYwplMe7iF8iMjuQU5">

Topologi Sederhana Static Routing

Jika topologi berubah seperti di atas, dimana PC-A dapat berkomunikasi dengan PC-B maka konfigurasinya ditambahkan seperti di bawah ini.

<pre>
R1> ip route 20.20.20.0 255.255.255.0 10.10.10.254 
R1> ip route 12.12.12.0 255.255.255.0 10.10.10.254

R2> ip route 11.11.11.0 255.255.255.0 10.10.10.1 
R2> ip route 12.12.12.0 255.255.255.0 20.20.20.254

R4> ip route 10.10.10.0 255.255.255.0 20.20.20.1 
R4> ip route 11.11.11.0 255.255.255.0 20.20.20.1
</pre>

Kebanyakan static routing dilakukan menggunakan next-hop IP Address. Jika menggunakan next-hop IP Address, semua router juga harus menggunakan next-hop IP Address. Jika salah satu menggunakan outgoing interface, maka pada praktiknya tidak bisa.

Atau bisa juga menggunakan default route.

<pre>
R1> ip route 0.0.0.0 0.0.0.0 10.10.10.254 
R1> ip route 0.0.0.0 0.0.0.0 40.40.40.1

R2> ip route 0.0.0.0 0.0.0.0 10.10.10.1 
R2> ip route 0.0.0.0 0.0.0.0 20.20.20.254

R3> ip route 0.0.0.0 0.0.0.0 30.30.30.1 
R3> ip route 0.0.0.0 0.0.0.0 40.40.40.254

R4> ip route 0.0.0.0 0.0.0.0 20.20.20.1 
R4> ip route 0.0.0.0 0.0.0.0 30.30.30.254
</pre>

Untuk menghapus tabel routing, bisa menambahkan perintah no di depan perintah ip route.

<pre>
R1> no ip route 0.0.0.0 0.0.0.0 10.10.10.254 
R1> no ip route 0.0.0.0 0.0.0.0 40.40.40.1
</pre>
